//Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, 
//и проверяет, является ли этот день выходным.
//
//6 -> да
//7 -> да
//1 -> нет

Console.Clear();
Console.WriteLine("Введите номер дня недели ");
int n1 = Convert.ToInt32(Console.ReadLine());
if (n1 == 6 || n1 == 7) 
    Console.WriteLine($"yes");
else 
    Console.WriteLine($"no");